#1)გამოიყენეთ შედარების ოპერატორები: <,>,==, !=, >=,<=

#1.ტოლობის შემოწმება: არის თუ არა 10 ტოლი 20-ის?
#2.უთანასწორობის შემოწმება: არის თუ არა 10 არატოლი 20-ის?
#3.ნაკლებობის შემოწმება: არის თუ არა 10 ნაკლები ვიდრე 20?
#4.მეტობის შემოწმება: არის თუ არა 10 მეტი ვიდრე 20?
#5.ნაკლები ან ტოლი რაოდენობის შემოწმება: არის თუ არა 10 ნაკლები ან ტოლი ვიდრე 20?
#6.მეტი ან ტოლი რაოდენობის შემოწმება: არის თუ არა 10 მეტი ან ტოლი ვიდრე 20?

print (20 == 40)
print (50 == 100)
print (25 == 60)

print (20 != 40)
print (50 != 100)
print (25 != 60)

print (20 < 40)
print (50 < 100)
print (25 < 60)

print (20 > 40)
print (50 > 100)
print (25 > 60)

print (20 <=40)
print (50 <=100)
print (25 <=60)

print (20 >= 40)
print (50 >= 100)
print (25 >= 60)