#2) კომენტარის სახით თქვენი სიტყვებით ახსენით რა არის reassign (მნიშვნელობის გადაწერა), 
#debugging (error'ების გამოსწორება), რატომ ვიყენებთ კომენტარებს

#ჩემი სიტყვებით, რომ ავხსნა "reassign" მე ამას ვიტყოდი, მაგალითად, ავიღოთ ყუთI და დავaრქვათ "books"
#და ჩავდოთ შიგნით "math book"

books = "math book" 

#ეხლა კი ჩავდოთ კიდევ ერთი წიგნი "english book"

books = "english book"

#თუ დავაჭერთ "run"-ს, ჩვენ მივცემთ კომპიუტერ იმის ნიშანს რომ მოგვცეს ერთი წიგნი (ჩვენს შემთხვევაში)
#იგი ჩვენ "english book"-ს მოგვცემს რადგან ყუთში ის უფრო მაღლა დევს და მას პირველი წვდება და მასაც მოგვცემს.


#debugging კი ნიშნავს შეცდომების გამოსწორებას. როდესაც ვწერთ კოდს, შეიძლება რაიმე შეცდომა ვერ შევამჩნიოთ და
#შემდეგ ეს ყველაფერი უნდა გადავამოწმოთ, რათა ვნახოთ გვაქვს თუ არა რაიმე შესასწორებელი.