// პატარა კალკულატორი
// განსაზღვრეთ ფუნქცია სახელწოდებით simple_calculator, რომელიც იღებს სამ არგუმენტს:
// num1: პირველი რიცხვი (მთლიანი ან float).
// num2: მეორე რიცხვი (მთლიანი ან float).

// ოპერაცია: სტრიქონი, რომელიც განსაზღვრავს შესასრულებლად ოპერაციას. ის შეიძლება იყოს „დამატება“, „გამოკლება“, „გამრავლება“ ან „გაყოფა“.
// ფუნქციის შიგნით,

// გამოიყენეთ if და elif განცხადებები, რათა დაადგინოთ რომელი ოპერაცია უნდა შეასრულოთ ოპერაციის არგუმენტის მნიშვნელობიდან გამომდინარე.

// ფუნქციამ უნდა დააბრუნოს ოპერაციის შედეგი.

// თუ ოპერაცია არის „გაყოფა“ და num2 არის 0, ფუნქციამ უნდა დააბრუნოს „შეცდომა: ნულზე გაყოფა შეუძლებელია“.
// ჩაწერეთ კოდი, რომ გამოიძახოთ ფუნქცია სხვადასხვა ოპერაციებით და დაბეჭდოთ შედეგები. 

function simpleCalculator(num1, num2, operation){
    if(operation == "+"){
        alert(num1 + num2)
    } else if(operation == "-"){
        alert(num1 - num2)
    } else if(operation == "*"){
        alert(num1 * num2)
    } else if(opeartion == "/"){
        if(num2 == 0){
            alert("Error: Division by zero.")
        } else{
            alert(num1 / num2)
        }
    }
}

simpleCalculator(20, 20, "-")