# 2) შექმენით 10 list'ი, ყველას ჰქონდეს იმდენი ელემენტი რომელი ლისტიცაა ( განსხვავებული ელემენტები ყველგან ), მაგალითად:
# list1-ში იქნება 1 ელემენტი
# list2-ში იქნება 2 ელემენტი
# list3-ში იქნება 3 ელემენტი და ა.შ
# შემდეგ კი ყველას დაუწერეთ კომენტარებად დადებითი და უარყოფითი ინდექსები, როგორც კლასში გავაკეთეთ

#           -1
list1 = ["item1"]
#            0

#           -1       -2
list2 = ["item2", "item3"]
#           0        1

#          -1       -2       -3
list3 = ["item4", "item5", "item6"]
#           0        1        2

#           -1       -2       -3       -4
list4 = ["item7", "item8", "item9", "item10"]
#           0         1        2       3  

#           -1       -2         -3       -4         -5
list5 = ["item11", "item12", "item13", "item14", "item15"]
#            0       1          2         3          4

#           -1       -2          -3       -4        -5        -6
list6 = ["item16", "item17", "item18", "item19", "item20", "item21"]
#            0       1          2         3          4         5

#           -1       -2          -3       -4        -5        -6        -7
list7 = ["item22", "item23", "item24", "item25", "item26", "item27", "item28"]
#            0       1          2         3          4         5         6

#           -1       -2          -3       -4        -5        -6        -7        -8
list8 = ["item29", "item30", "item31", "item32", "item33", "item34", "item35", "item36"]
#            0       1          2         3          4         5         6         7

#           -1       -2          -3       -4        -5        -6        -7        -8        -9
list9 = ["item37", "item38", "item39", "item40", "item41", "item42", "item43", "item44", "item45"]
#            0       1          2         3          4         5         6         7         8

#           -1       -2           -3       -4       -5         -6        -7        -8        -9        -10
list10 = ["item46", "item47", "item48", "item49", "item50", "item51", "item52", "item53", "item54", "item55"]
#            0       1          2         3          4         5          6         7         8         9