#2) შექმენით ცვლადი num, რომლის მნიშვნელობასაც შემოიტანს მომხმარებელი (გამოიყენეთ input() ფუნქცია).
#თუ ეს რიცხვი ტოლი იქნება 18ის მაშინ გამოუტანეთ რომ მან მოიგო სათამაშო დინოზავრი, თუ ეს რიცხვი 
#ტოლი იქნება 33ის მაშინ გამოუტანეთ რომ მან მოიგო სათამაშო კურდღელი,ყველა სხვა შემთხვევაში გამოუტანეთ
#რომ ვერაფერი ვერ მოიგო და მომავალში თავიდან სცადოს.

num = int(input("Guess the number: "))
if num == 18:
    print("You won toy dinosaur!")
elif num == 33:
    print("You won toy rabbit!")
else:
    print("You didn't won anything...")