// სტუდენტისგან შემოტანეთ 3 სხვადასხვა საგნის ქულა, შემდეგ გამოითვალეთ საშუალო ქულა და საშუალო ქულის შესაფერისად გამოტანეთ შეფასება, თუ სტუდენტის ქულა მეტია 90 -  ზე და ნაკლებია 100 - ზე, მაშინ გამოიტანეთ 'A', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 70 - ზე და ნაკლებია 80 - ზე, მაშინ გამოიტანეთ 'B', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 50 - ზე და ნაკლებია 65 - ზე, მაშინ გამოიტანეთ 'C', სხვა შემთხვევაში თუ სტუდენტის ქულა მეტია 25 - ზე და ნაკლებია 50 - ზე, მაშინ გამოიტანეთ 'D', ხოლო თუ 25 -  ზე ნაკლებია, მაშინ გამოიტანეთ 'წადი ისწავლე და მერე მოდი'
// დრო: 15წთ.
// შემოიტანეთ ისეთი მნიშვნელობები, რომლებიც გამოიტანს ყველა შეფასებას (A,B,C,D, 'წადი ისწავლე და მერე მოდი')

function getAverage(a, b, c) {
    let average = (a + b + c) / 3;
    let grade = (90 <= average) ? 'A' : (70 <= average) ? 'B' : (50 <= average) ? 'C' : (25 <= average) ? 'D' : 'წადი ისწავლე და მერე მოდი';
    return grade;
}

console.log(getAverage(90, 90, 90)); // A