# 1) ჩამოწერეთ და ახსენით თითოეული collection ტიპის თვისებები რაც დღეს ვისწავლეთ/გავიმეორეთ (list, tuple, set)
# 2) შექმენით თითოეული, ანუ list1, tuple1, set1 ცვლადები
# 3) გამოიყენეთ ნასწავლი ფუნქციები კოლექციებზე, თუ გამოყენება არ შეიძლება მაშინ ახსენით რატომ


# list არის კონტეინერი რომელშიც შეგვიძლია მრავალი ელემენტი შევინახოთ და მისი დამახასიათებელი ბრჩხილების ტიპია []. მას გააჩნია indexing, შესაბამისად slicing და არის muttable. შეგვიძლია ნებისმიერი მონაცემების ტიპის შენახვა.

list1 = [1, 2, 3, 4]
list1.append(5)
list1.pop(0)
list1.insert(0, 0)
list1[0] = 0
list1[0:3]


# tuple არის კონტეინერი რომელშიც შეგვიძლია მრავალი ელემენტი შევინახოთ და მისი დამახასიათებელი ბრჩხილების ტიპია (). მას გააჩნია indexing, შესაბამისად slicing, მაგრამ list-ისგან განსხვავებით არის immutable. შეგვიძლია ნებისმიერი მონაცემების ტიპის შენახვა.

tuple1 = (1, 2, 3, 4)
tuple1[0]
tuple1[0:3]


# set არის კონტეინერი რომელშიც შეგვიძლია მრავალი ელემენტი შევინახოთ და მისი დამახასიათებელი ბრჩხილების ტიპია {}. მას არ გააჩნია indexing, მაგრამ არის muttable (remove, add). შეგვიძლია ნებისმიერი მონაცემების ტიპის შენახვა. მასში რამოდენიმეჯერ ერთი და იგივე ელემენტის ჩაწერის მიუხედავად დუბლიკატებს არ გამოიტანს.

set1 = {1, 2, 3, 4}
set1.add(5)
set1.remove(1)