// დავალება 1: უნივერსიტეტის მონაცემები
// შექმენით university ობიექტი, რომელიც შეიცავს შემდეგ თვისებებს:


// name - უნივერსიტეტის სახელი
// departments - ფაკულტეტების რაოდენობა
// website - უნივერსიტეტის ვებსაიტი
// ratings - ჩაშენებული ობიექტი, სადაც იქნება 3 სტუდენტის შეფასება


// შემდეგ:


// გამოიტანეთ ობიექტის ყველა თვისება და მნიშვნელობა.

// შეამოწმეთ, გააჩნია თუ არა scholarship თვისება.

// დაამატეთ studentsCount ახალი ობიექტის გაერთიანებით.

// გაყინეთ ობიექტი და სცადეთ მისი შეცვლა.

// შეამოწმეთ, გაყინულია თუ არა ობიექტი.


let university = {
    name: "Tbilisi State University",
    departments: 7,
    website: "www.tsu.ge",
    ratings: {
        student1: 5,
        student2: 4,
        student3: 3
    }
};