// FizzBuzz
// შექმენით FizzBuzz პროგრამა, რომელიც მუშაობს შემდეგნაირად⬇️

// თუ რიცხვი უნაშთოდ იყოფა 3-ზე, დაიბეჭდოს "Fizz".
// თუ რიცხვი უნაშთოდ იყოფა 5-ზე, დაიბეჭდოს "Buzz".
// თუ რიცხვი უნაშთოდ იყოფა ორივე (3-ზეც და 5-ზეც), დაიბეჭდოს "FizzBuzz".
// თუ არცერთი პირობა არ შესრულდება, დაიბეჭდოს თავად რიცხვი

for (let i = 0; i < 100; i++) {
    if(i % 3 == 0){
        console.log("Fizz")
    } else if(i % 5 == 0){
        console.log("Buzz")
    } else if(i % 15 == 0){
        console.log("FizzBuzz")
    } else{
        console.log(i)
    }
}