// შექმენით წიგნის ობიექტი, რომელშიც იქნება შეტანილი რამოდენიმე თვისება, ეს თვისებებია:  წიგნის სათაური, წიგნის ავტორი, წიგნის გამოშვების წელი, წიგნის ჟანრი, წიგნის ფასი.
// ობიექტის შექმნის შემდეგ, გამოიტანეთ პირველი ობიექტი.
// გამოიტანეთ სათითაო თვისების მნიშვნელობა. გამოიყენეთ გამოტანის ორივე გზა(Dot & Bracket Notation)
// შეტანილი თვისებებით დაბეჭდეთ ერთი დიდი წინადადება, რომელშიც გამოყენებული იქნება ყველა თვისება.

let book = {
    title: "The Lord of the Rings",
    year: 1954,
    janre: "Fantasy",
    price: 20
}

console.log(book.title)
console.log(book["year"])