#1) გადაიტანეთ ეს კოდი visual studio code'ში და დაუწერეთ კომენტარები

#შევქმენით ცვლადი რომელსაც დავარქვით "სახელი" და მივანიჭეთ მნიშვნელობა "დათა"
name = "data"

#შევქმენით ცვლადი რომელსაც დავარქვით "გვარი" და მივანიჭეთ მნიშვნელობა "დიასამიძე"
surname = "diasamidze"

#შევქმენით ცვლადი რომელსაც დავარქვით "ასაკი" და მივანიჭეთ მნიშვნელობა 100
age = 100

#შევქმენით ცვლადი რომელსაც დავარქვით "ტექსტი" და მივანიჭეთ მნიშვნელობა "მე ვარ პროგრამისტი"
text = "I am programmer"

#გამოვიტანეთ ტერმინალში მათი შეერთებით მიღებული პასუხი
print("My name is" + " " + name + " " + "my surname is" + " " + surname + " " + "my age is" + " " + str(age) + " " + text)