// შექმენით 3 ცვლადი, რომელიც არის let - ით შექმნილი და მიანიჭეთ მნიშვნელობები.
// შექმენით 3 ცვლადი, რომელიც არის const - ით შექმნილი და მიანიჭეთ მნიშვნელობები.
// 3, ახსენით კომენტარებით თუ რა არის let
// ახსენით კომენტარებით თუ რა არის const
// ახსენით კომენტარებით თუ რა განსხვავებაა let - სა და const - ს შორის.

let name = "Andria";
let lastname = "Andria";
let age = 12;

const sport = "Football"
const league = "Premier League"
const team = "Manchester United"

// let არის ხერხი რომლითაც შეგვიძლია შევქმნათ ცვლადები, როგორც const.
// მაგრამ მათ შორის ისაა განსხვავება რომ let-ით შექმნილ ცვლადს შემიძლია შევუცვალო მნიშვნელობა, ხოლო const-ით არა.