// შექმენით პროგრამა, რომელიც იღებს მომხმარებლის პირად მონაცემებს და სთავაზობს რეკომენდაციებს ტრანსპორტის არჩევისთვის.
// საფეხურები:
// პროგრამამ უნდა მიიღოს შემდეგი მონაცემები მომხმარებლისგან:


// სახელი
// ასაკი
// სამუშაო ადგილამდე მანძილი (კმ-ში)
// სამუშაო დღეების რაოდენობა კვირაში (0-დან 7-მდე)

// მონაცემების მიღების შემდეგ, პროგრამა უნდა შეასრულოს შემდეგი შემოწმებები:


// თუ მომხმარებლის ასაკი ნაკლებია 16-ზე, პროგრამა უნდა დაბეჭდოს, რომ "გთხოვთ, მოითხოვოთ გამგზავრების ნებართვა უფროსისგან".
// თუ მომხმარებლის ასაკი არის 16 ან მეტი და ნაკლებია 65-ზე, პროგრამა უნდა შეამოწმოს, სამუშაო ადგილამდე მანძილი და რეკომენდაცია გაუკეთოს ტრანსპორტი, მაგალითად:


// თუ მანძილი 0-დან 5 კმ-მდეა: რეკომენდირებული ტრანსპორტი არის ველოსიპედი.
// თუ მანძილი 5-დან 20 კმ-მდეა: რეკომენდირებული ტრანსპორტი არის მანქანა.
// თუ მანძილი 20 კმ-ზე მეტია: რეკომენდირებული ტრანსპორტი არის მატარებელი.

// თუ მომხმარებლის სამუშაო დღეების რაოდენობა კვირაში 5 ან მეტი დღეა, პროგრამა უნდა სთხოვოს შეღავათების მიღება ტრანსპორტზე.

function transportRecommendation(name, age, distance, days) {
    if (age < 16) {
        console.log("გთხოვთ, მოითხოვოთ გამგზავრების ნებართვა უფროსისგან");
    } else if (age >= 16 && age < 65) {
        if (distance >= 0 && distance <= 5) {
            console.log("რეკომენდირებული ტრანსპორტი არის ველოსიპედი");
        } else if (distance > 5 && distance <= 20) {
            console.log("რეკომენდირებული ტრანსპორტი არის მანქანა");
        } else {
            console.log("რეკომენდირებული ტრანსპორტი არის მატარებელი");
        }
    } else {
        console.log("რეკომენდაცია გაუკეთოს ტრანსპორტი");
    }
    if (days >= 5) {
        console.log("შეღავათების მიღება ტრანსპორტზე");
    }}