#5) ამ კოდში არის 2 შეცდომა, გამოასწორეთ ეს შეცდომები და ახსენით რა იყო შეცდომა და რატომ არ შეიძლებოდა ასე დაწერა

# str = "hello"
# str[1] = "o"

# print(str)

#str არის ფუნქცია, ამიტომ არ შეგვიძლია რომ ეს სახელი ცვლადს დავარქვათ
word = "hello"
#ასევე არ შეგვიძლია სტრინგის რაიმე ასოების შეცვლა ინდექსის დახმარებით, ამიტომ უნდა შევქმნათ ახალი ცვლადი
#შიგნის კი ჩავუწეროთ ინდექსის დახმარებით ასოები, და შესაცვლელი ასოს ინდექსის ნაცვლად კი სხვა ასო უნდა ჩავწეროთ
new_word = word[0] + "o" + word[2] + word[3] + word[4]

print(new_word)